injector2degHex/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField //LP: https://www.openfoam.com/documentation/user-guide/standard-boundaryconditions.php
{
    inlet
    {
        type            fixedValue;
        value       uniform 5e5;
	// type            prghTotalPressure;
    //     p0           	uniform 2000000;
	// value		uniform 2000000;
        
    }

    outlet
    {	
	    type            fixedValue;
    	value		uniform 1e5;
    }

    walls
    {
        type            fixedFluxPressure;
    }

    sides
    {
        type            symmetry; //LP: pretty sure this should be "cyclic" https://www.openfoam.com/documentation/guides/latest/doc/guide-bcs-coupled-cyclic.html 
    }
}

// ************************************************************************* //
