injector2degHex/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       42256;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       42376;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          632;
        startFace       42496;
    }
    sides
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          11021;
        startFace       43128;
    }
)

// ************************************************************************* //
