injector2degHex/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

phaseChangeTwoPhaseMixture SchnerrSauer;

pSat            40.012e5;   // nitrous sat pressure @ 10 C 2300;// 

sigma           3.6714e-03; // nitrous surface tension @ 10 C original: 0.07;//

water //nitrous properties at 10 C 
{
    transportModel  Newtonian;
    nu              7.8391e-5;//original 9e-7;//
    rho             8.5217e2;//original 1000;//
}

vapour //nitrous properties at 10 C 
{
    transportModel  Newtonian;
    nu              1.4163e-1;//original: 4.273e-4;//
    rho             1.1491e2;//original: 0.02308;//
}

//these are all still for water
KunzCoeffs 
{
    UInf            U20.0;
    tInf            t0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}


// ************************************************************************* //
