injector2degHex/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interPhaseChangeFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime; //used to be endTime, writeNow for emergency stop

endTime         0.30;//was 3ms

deltaT          1e-3;//1e-5;//1e-3 runs easily

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           5; 

//LP: perhaps use eddie's custom restriction block in matlab to predict the maximum velocity, and find what our mesh size should be for ideal courant number from that?


// ************************************************************************* //
