injector2degHex/case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0//only air in the domain
);

regions
(
    boxToCell
    {       //values from checkMesh
        box (0.000113418 42.5e-3 0) (0.0297362 0.0801333 0.0011201); //sets nitrous to be liquid 3/4 of the way down the injector as specified in UoT paper
        fieldValues
        (
            volScalarFieldValue alpha.water 1//we set our block of water into the domain
        );
    }
);


// ************************************************************************* //
